#include <stdio.h>        // подключаем заголовочный файл stdio.h
#include <locale.h>



int main(void)
{
    char* locale = setlocale(LC_ALL, "");

    printf("///////// Глава 03. Операторы\n");

    printf("\n\n\n/////////// Логические значениия ИСТИНА (True) и ЛОЖЬ (False) в языке С\n");
    // http://paulfertser.info/polnyy_spravochnik_po_c_gerbert_shildt/03/0301.htm
    /*
    При выполнении многих операторов языка С вычисляются значения условных выражений и в зависимости от полученного
    значения выбирается та или иная ветвь вычислительного процесса. Условное выражение может принимать одно из двух
    значений: ИСТИНА или ЛОЖЬ. В языке С значение ИСТИНА представлено любым ненулевым значением, включая отрицательные
    числа. Значение ЛОЖЬ всегда представлено нулем. Такое представление логических значений ИСТИНА и ЛОЖЬ позволяет
    весьма эффективно программировать многие процедуры.
    */






    printf("\n\n\n/////////// Условные операторы\n");
    // http://paulfertser.info/polnyy_spravochnik_po_c_gerbert_shildt/03/0302.htm
    /*
    При выполнении многих операторов языка С вычисляются значения условных выражений и в зависимости от полученного
    значения выбирается та или иная ветвь вычислительного процесса. Условное выражение может принимать одно из двух
    значений: ИСТИНА или ЛОЖЬ. В языке С значение ИСТИНА представлено любым ненулевым значением, включая отрицательные
    числа. Значение ЛОЖЬ всегда представлено нулем. Такое представление логических значений ИСТИНА и ЛОЖЬ позволяет
    весьма эффективно программировать многие процедуры.
    */









    printf("\n\n\n/////////// 000\n");
    /*

    */

    printf("\n\n\n/////////// 000\n");
    /*

    */

    printf("\n\n\n/////////// 000\n");
    /*

    */

    printf("\n\n\n/////////// 000\n");
    /*

    */



    printf("\n\n\n/////////// 000\n");
    /*

    */
    return 0;
}


