#include <iostream>

int main()
{
	// http://paulfertser.info/polnyy_spravochnik_po_c_gerbert_shildt/04/04.htm
	printf("///////// √лава 04. ћассивы и строки\n");
	/*
	ћассив Ч это набор переменных одного типа, имеющих одно и то же им€. ƒоступ к конкретному элементу массива 
	осуществл€етс€ с помощью индекса. ¬ €зыке — все массивы располагаютс€ в отдельной непрерывной области пам€ти. 
	ѕервый элемент массива располагаетс€ по самому меньшему адресу, а последний Ч по самому большому. ћассивы могут 
	быть одномерными и многомерными. —трока представл€ет собой массив символьных переменных, заканчивающийс€ специальным
	нулевым символом, это наиболее распространенный тип массива.

	ћассивы и указатели тесно св€заны. “о, что может быть сказано о массивах, чаще всего непосредственно относитс€ и к
	указател€м, и наоборот. ¬ этой главе рассматриваютс€ массивы, указатели будут подробно рассмотрены в главе 5. ƒл€ 
	полного понимани€ приемов работы с массивами и указател€ми читателю следует хорошо усвоить обе эти главы. 
	
	*/











}
